Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties.BuiltupMode Property
 The builtup mode of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartAnalysisProperties.BuiltupEnum BuiltupMode { get; set; }
Public Property BuiltupMode As AnalysisPartAnalysisProperties.BuiltupEnum
	Get
	Set
Property Value
Type: AnalysisPartAnalysisProperties.BuiltupEnum
See Also
Reference
AnalysisPartAnalysisProperties Class
Tekla.Structures.Analysis Namespace